from SignalLib import *

def func(d, w1, w2):
    """
    “技术分析系拥抱选股因子”系列研究（七）：量稳换手率选股因子：量小、量缩，都不如量稳？_2021-05-16_东吴证券
    本节内容，我们继续利用日频数据，从考察“日频换手率稳定性”的角度，构造选股因子。具体操作步骤如下：
    （1）每月月底，回溯每只股票过去 20 个交易日，计算其 20 日换手率的标准差；
    （2）在横截面上做市值中性化处理，即得到所有股票当月的因子值，记为量稳换手率因子 STR（即换手率的稳定性，The Stability of Turnover Rate）
    ====================================================================================================================
    日内交易特征稳定性与股票收益——因子选股系列之四十九-东方证券
    7 个日内交易特征稳定性因子在各个样本空间均展现出日内交易特征稳定性
    越差的股票未来平均收益越低的选股效果
    我们可以计算日内 5分钟成交量的波动率𝑉𝑉𝑂𝐿𝑖,𝑡
    除此之外我们还通过赫芬达尔—赫希曼指数(Herfindahl-Hirschman Index，简称 HHI）考察了日内成交量在不同交易时间分布的离散程度
    我们采用 (其實沒有) Newey West 调整后的标准差度量股票在过去一段时间内的稳定性
    Parameters
    ----------
    d :
    w1 : 第一個 STD 窗口
    w2 : 第二個 STD 窗口

    Returns
    -------

    """

    v = d['v']
    # ==================================================================================================================
    # STR
    STR = ta.STDDEV(v, w2)
    # ==================================================================================================================
    # PctTurn
    PctTurn = np.nan_to_num((ta.MA(v, w1) / shift(ta.MA(v, w1), w2)) - 1, nan=0, posinf=0, neginf=0)
    # ==================================================================================================================
    # 赫芬达尔—赫希曼指数(Herfindahl-Hirschman Index，简称 HHI）
    # VHHI = ta.SUM(np.power(np.where(sub := ta.SUM(v, w1) > 0, v / sub, 0), 2), w1)
    # res1 = ta.STDDEV(STR, w2)
    # res2 = ta.STDDEV(ffill(VHHI), w2)

    return PctTurn, STR #, res1, res2


if __name__ == '__main__':
    for ns in [[20, 20], [20, 50], [20, 100], [50, 50], [50, 80], [50, 100], [50, 200]]:
        res = run_test(func, *ns, w=5)
